Catalogs/Спецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Спецификации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСпецификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСпецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>#12082 отключена проверка заполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_ПорядокОкругления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьВБольшуюСторону</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОкругленияЧислом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированноеКоличество</Name>
							<Comment>#88</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСпецификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СпецификацияПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СопутствующиеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплектация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Спецификации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем ПредыдущийВладелец; // №14082

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Спецификации.Ссылка
		|ИЗ
		|	Справочник.Спецификации КАК Спецификации
		|ГДЕ
		|	Спецификации.Владелец = &Владелец
		|	И Спецификации.ВидСпецификации = &ВидСпецификации
		|";
		Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
		Запрос.УстановитьПараметр("ВидСпецификации", Объект.ВидСпецификации);
		
		//#12667
		ПрефиксНаименования = "Спецификация";
		НаименованиеПоУмолчаниюПервая = "";
		НаименованиеПоУмолчаниюПоследующие = "";
		Если Объект.ВидСпецификации = Перечисления.ВидыСпецификации.СпецификацияПродукции Тогда
			ПрефиксНаименования = "Спецификация продукции";
			НаименованиеПоУмолчаниюПервая  = "Основная спецификация";
			НаименованиеПоУмолчаниюПоследующие = "Спецификация";
		ИначеЕсли Объект.ВидСпецификации = Перечисления.ВидыСпецификации.СопутствующиеМатериалы Тогда
			ПрефиксНаименования = "Спецификация сопутствующих материалов";
			НаименованиеПоУмолчаниюПервая  = "Основная спецификация";
			НаименованиеПоУмолчаниюПоследующие = "Спецификация";
		ИначеЕсли Объект.ВидСпецификации = Перечисления.ВидыСпецификации.Комплектация Тогда
			ПрефиксНаименования = "Спецификация комплектации";
			НаименованиеПоУмолчаниюПервая  = "Основная комплектация";
			НаименованиеПоУмолчаниюПоследующие = "Комплектация";
		КонецЕсли;
	
		КоличествоСпецификаций = Запрос.Выполнить().Выбрать().Количество();
		Если КоличествоСпецификаций > 0 Тогда
			Объект.Наименование = НаименованиеПоУмолчаниюПоследующие + " №" + Формат(КоличествоСпецификаций+1, "ЧГ=");
		Иначе
			Объект.Наименование = НаименованиеПоУмолчаниюПервая;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщийМодульСервер.ЗаполнитьПредопределенныеПорядкиОкругления(Элементы.СоставПорядокОкругления);
	
	//#12667
	Элементы.ВидСпецификации.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ВидСпецификации);
	
	УправлениеФормой();
 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПредыдущийВладелец = Объект.Владелец;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ссылка",Объект.Ссылка);
	СтруктураПараметров.Вставить("Владелец",Объект.Владелец);
	СтруктураПараметров.Вставить("ВидСпецификации",Объект.ВидСпецификации);  //#12667
	Оповестить("СохранениеСпецификации",СтруктураПараметров,"СпецификацияФорма");
	
	//#12667
	Элементы.ВидСпецификации.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ВидСпецификации);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//#14089
	ПроверитьИспользованиеКакОсновной(ТекущийОбъект.Ссылка, ТекущийОбъект.Владелец, Объект.Ссылка.Владелец, Отказ);
	
	// №14925 нельзя включить в состав услуги
	Для Каждого ТекущаяСтрока Из ТекущийОбъект.Состав Цикл
		
		Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		Отказ = Истина;
		Сообщить(СтрШаблон("В строке %1 указана номенклатура ""%2"" с видом ""Услуга"".", ТекущаяСтрока.НомерСтроки, ТекущаяСтрока.Номенклатура));
		
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	//++ #14082
	Отказ = Ложь;
	ПроверитьИспользованиеКакОсновной(Объект.Ссылка, Объект.Владелец, ПредыдущийВладелец, Отказ);
	Если Отказ Тогда
		Объект.Владелец = ПредыдущийВладелец;
	Иначе
		ПредыдущийВладелец = Объект.Владелец;
	КонецЕсли;
	//-- #14082
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Состав.ТекущиеДанные;
		
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	
	СтруктураДанные = СоставНоменклатураПриИзмененииНаСервере(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Коэффициент = СтруктураДанные.Коэффициент;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоставНоменклатураПриИзмененииНаСервере(СтруктураДанные)
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.БазоваяЕдиницаИзмерения);
	СтруктураДанные.Вставить("Коэффициент", 1);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКоэффициентЕдиницыИзмерения(ЕдиницаИзмерения)
	Если ТипЗнч(ЕдиницаИзмерения) = ТипЗнч(Справочники.ЕдиницыИзмерений.ПустаяСсылка()) Тогда
		Возврат ЕдиницаИзмерения.Коэффициент;
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СоставЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Состав.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Состав.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = Объект.Владелец Тогда
		Сообщить("В составе спецификации нельзя указывать номенклатуру, которая является владельцем спецификаии!",СтатусСообщения.Важное);
		ВыбранноеЗначение = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидСпецификацииПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	//#12667
	Элементы.ДекорацияСпецификацияПродукции.Видимость = (Объект.ВидСпецификации = Перечисления.ВидыСпецификации.СпецификацияПродукции);
	Элементы.ДекорацияСопутствующиеМатериалы.Видимость = (Объект.ВидСпецификации = Перечисления.ВидыСпецификации.СопутствующиеМатериалы);
	Элементы.ДекорацияКомплектация.Видимость = (Объект.ВидСпецификации = Перечисления.ВидыСпецификации.Комплектация);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьИспользованиеКакОсновной(ТекущаяСсылка, ТекущийВладелец, ПредыдущийВладелец, Отказ)
	
	//#14089
	Если ЗначениеЗаполнено(ТекущаяСсылка) И НЕ ТекущийВладелец = ПредыдущийВладелец Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпрНоменклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	(СпрНоменклатура.ОсновнаяСпецификацияСопутствующиеМатериалы = &Спецификация
		|			ИЛИ СпрНоменклатура.ОсновнаяСпецификацияКомплектация = &Спецификация
		|			ИЛИ СпрНоменклатура.ОсновнаяСпецификация = &Спецификация)";
		Запрос.УстановитьПараметр("Спецификация", ТекущаяСсылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данная спецификация указана основной для номенклатуры: " + Выборка.Ссылка + ". Смена владельца запрещена.", ,,, Отказ);		
		КонецЦикла;
		
	КонецЕсли;
		
КонецФункции

#КонецОбласти
